# Terminal
cask "iterm2"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-you-should-use"
brew "fzf"
brew "atuin"
brew "zoxide"
brew "micro"

# Современные замены CLI-утилит
brew "bat"          # cat
brew "eza"          # ls
brew "fd"           # find
brew "ripgrep"      # grep
brew "trash"        # rm (в корзину)

# Git
brew "lazygit"
brew "git-delta"

# Docker
brew "lazydocker"

# Языки и рантаймы
brew "go"
brew "nvm"
brew "libpq"
brew "python"

# Медиа
brew "yt-dlp"

# Утилиты
cask "maccy"
cask "bitwarden"
cask "appcleaner"
cask "bettertouchtool"
cask "karabiner-elements"
cask "sublime-text"

# AI
cask "claude"
cask "claude-code"

# Приложения
cask "google-chrome"
cask "telegram"
cask "iina"
cask "todoist-app"
cask "obsidian"
cask "morgen"
cask "yandex-music"
cask "arc"
cask "qbittorrent"
cask "bruno"
